--------

# **01. SELF JOIN**

* **SET JOIN** joins another copy of the table itself 
* It used to compare rows of the same table 
* And helps to display the hierarchy of the table

```SQL

-------ADDING COLUMN----------

ALTER TABLE customers
ADD COLUMN referral_id INT;
SELECT * FROM customers

-------VALUE UPDATE -----

update customers
SET referral_id = 1
where customer_id = 2;
SELECT * FROM customers;

-------SET JOIN----------
A B IS LIKE THE "THIS POINT THE A TABLE AND B TABLE OF CUTSOMERS COPY"

SELECT *
FROM customers AS A
INNER JOIN 
customers AS B
ON A.referral_id = B.customer_id;


---------SPECIFIC DATA-------

SELECT A.customer_id,A.first_name, A.last_name , B.first_name, B.last_name
FROM customers AS A
INNER JOIN 
customers AS B
ON A.referral_id = B.customer_id;


-------MAKE THE REFERRAL MORE FURTHER-------

SELECT A.customer_id,A.first_name, A.last_name,
	CONCAT(B.first_name," ", B.last_name) AS REFERED_BY
FROM customers AS A
INNER JOIN 
customers AS B
ON A.referral_id = B.customer_id;

### **ANOTHER EXAMPLE**

```sql

-------employee table--------

UPDATE employees
SET supervise_id = 3
where employee_id = 1;
SELECT * FROM employees;

------------------------------

SELECT A.first_name, A.last_name, A.job,
concat(B.first_name," ", B.last_name) as "SUPERVISING PERSON",  B.job
FROM employees AS A
INNER JOIN employees AS B
ON A.supervise_id = B.employee_id;

----------

# **02. VIEWS**

* In SQL, a view is a virtual table based on the result-set of an SQL statement. A view contains rows and columns, just like a real table. The fields in a view are fields from one or more real tables in the database.
* they are not a real table but can be interacted with as if they are

```SQL

--------CREATING THE VIEW-------

CREATE VIEW EMPLOYEE_ATTENDANCE AS
SELECT first_name , last_name FROM employees;
SELECT * FROM employee_attendance;

------ORDER BY-------

SELECT * FROM employee_attendance
ORDER BY LAST_NAME ASC;

-----DROP THE VIEW-------

DROP VIEW employee_attendance;

### **ANOTHER EXAMPLE (CUSTOMERS)**

```SQL

-------CREATE THE NEW COLUMN------
alter table customer 
add column EMAIL_ID ;

--------UPDATE THE COLUMN-------
UPDATE customers
SET EMAIL_ID = "henry@gmail.com"
WHERE customer_id = 4;
SELECT * FROM customers;

-----VIEW---------

CREATE VIEW CUSTOMER_EMAIL AS 
SELECT EMAIL_ID FROM customers;
SELECT * FROM customer_email;


------advantages----------
NOTE : "THIS WILL AUTOMATICALLY UPDATE WHEN WE INSERT THE VALUE IN THE CUSTOMER TBALE"

INSERT INTO customers
VALUES(5, "BRO", "CARB", NULL, "BRO@gmail.com");
SELECT * FROM customers

SELECT * FROM customer_email;

------------

### **03. INDEXING (TREE DATA STRUCTURE)**

```SQL

-------CUSTOMER TABLE -------
SHOW INDEXES FROM customers;

--------CREATE THE INDEX----------

CREATE INDEX last_name_idx 
ON customers(last_name);

--------SELECT-----------
SHOW INDEXES FROM customers;

------SEARCH -------
NOTE : "REDUCE THE TIME OF SEARCHING"

SELECT * FROM customers
WHERE last_name = "rebbaca";

-------delete index-------
ALTER TABLE customers
DROP INDEX last_name_idx;

#### **MULTI COLUMN INDEX**

```sql

--------CAN SEARCH FAST BOTH FIRST AND LAST NAME-----

CREATE INDEX LAST_NAME_FIRST_NAME_IDX
ON customers(last_name, first_name);

------------------
select * from customers
where last_name = "rebbaca" and first_name = "lona";

-----------

# **04. SUBQUERIES**

QUERY WITHIN ANOTHER QUERY

```sql

-----------query(subquery)-------------

SELECT first_name,last_name,hourly_paid,
        (SELECT avg(hourly_paid) from employees) as avergae_pay 
        
from employees;

---------query condition ----------

select first_name, last_name, hourly_paid from employees
where hourly_paid > (select avg(hourly_paid) from employees);


-------customer example---------

SELECT first_name, last_name from customers
where customer_id in 
(SELECT DISTINCT customer_id FROM transactions
WHERE customer_id IS NOT NULL);

--------------

# **05. GROUP BY**

The `GROUP BY` clause in MySQL is used to group rows that have the same values in specified columns into summary rows. It is often used with aggregate functions like `COUNT()`, `SUM()`, `AVG()`, `MAX()`, or `MIN()` to perform calculations on each group of rows.

#### WHEN YOU USINF GROUP BY **"WHERE CLAUSE"** WONT WORK INSTEAD USE **"HAVING CLAUSE"**

```sql

--------add columN order_date------
ALTER TABLE TRANSACTIONS 
ADD COLUMN ORDER_DATE CURRENT_DATE();

--------UPDATE COLUMN---

UPDATE transactions
SET ORDER_DATE = current_date() + 1000
where transaction_id = 1004;
SELECT * FROM transactions;

------INSERT NEW ROWS-------

insert into transactions(amount ,ORDER_DATE)
values(2.48, "2025-01-01"), (5.48, "2025-01-02");
SELECT * FROM transactions;

NOTE : "GROUP COLUMN VALUES ONE DAY SALES EX"

--------SUM-------

SELECT SUM(AMOUNT), ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE;

------MAX-------

SELECT MAX(AMOUNT), ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE;

----------MIN-------

SELECT MIN(AMOUNT), ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE;

------AVG------
SELECT AVG(AMOUNT), ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE;

---COUNT---

SELECT count(AMOUNT), ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE;

### **ANOTHER EXAMPLE**

```SQL

---------TRANSACTION --------
SELECT SUM(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id;

-----MAX------
SELECT MAX(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id;

-----MIN ------
SELECT MIN(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id;

---AVG ------
SELECT AVG(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id;

---------SPEACIL HAVING CLAUSE METHOD ----

SELECT COUNT(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id
HAVING AMOUNT > 2;

SELECT COUNT(amount) as AMOUNT, customer_id
FROM transactions
group by customer_id
HAVING AMOUNT > 1 AND customer_id is not null;

-------------

# **06. ROLLUP**

SHOWS THE COLUMN GRAND TOTAL
comes after the group clause

```SQL

----SUM-------
SELECT SUM(AMOUNT),ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE WITH ROLLUP;

-----COUNT------
SELECT COUNT(transaction_id),ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE WITH ROLLUP;

-----ALIS-(AS NAME)--------

SELECT COUNT(transaction_id) AS "NO OF TRANSACTION",ORDER_DATE
FROM transactions
GROUP BY ORDER_DATE WITH ROLLUP;


--------another example--------

SELECT SUM(hourly_paid) as "HOURLY PAID", employee_id
FROM employees
group by employee_id with rollup;

-----------

# **07. ON DELETE**

### `ON DELETE` in MySQL

The `ON DELETE` clause defines what happens when a row in the parent table is deleted. Possible actions:

- **`CASCADE`**: Deletes the corresponding rows in the child table.
- **`SET NULL`**: Sets the foreign key in the child table to `NULL`.
- **`RESTRICT`**: Prevents deletion if there are related rows in the child table.
- **`NO ACTION`**: Similar to `RESTRICT`, but with different timing of checks.

**Example**:
```sql
FOREIGN KEY (column_name) REFERENCES parent_table(parent_column) ON DELETE CASCADE;

```SQL

"IN THE TRANSACTION THE CUSTOMER_ID IS THE FOREIGN KEY SO WHERE WE CAN DELTE THE ROW"

STEP 1:

SELECT * FROM customers; 
" SELECT CUSTOMER_ID FROM CUSTOMERS WHICH AS VALUE IN TRANSACTION CUSTOMER_ID"

STEP 2:
SET FOREIGN_KEY_CHECKS = 0;


STEP 3:

DELETE FROM customers
where customer_id = 1;
SELECT * FROM customers;

STEP 4:
SET FOREIGN_KEY_CHECKS = 1;


"SO HERE CUSTOMER PRIMARY KEY HAS BEEN DELETED WHERE THE TRANSATION FORIEIGN KEY HAS THE CUSTOMER_ID HAS THE VALUE THERE TO CHANGE IT EITHER "NULL OR CASCADE" "

### **ON DELETE**

```SQL


-------REINSERT THE 1 VALUES------
INSERT INTO customers
VALUES(1, "JANE", "RUBY", NULL, "JANE@GMAIL.COM" );
SELECT * FROM customers

-----------WHILE CREATING TABLE---------

CREATE TABLE transactions(
		transaction_id INT PRIMARY KEY AUTO_INCREMENT,
        amount DECIMAL(5, 2),
        customer_id INT ,
        FOREIGN KEY(customer_id) REFERENCES customers(customer_id),
        ON DELETE SET NULL
        
);
SELECT * FROM transactions;


----------EXISTING TABLE-------


"1 DELETE FOREIGN KEY"

ALTER table transactions
DROP foreign key fk_customer_id;

"2. AUTOMATICALLY SET FOREIGN KEY AS NULL:"

ALTER table transactions
ADD constraint fk_customer_id 
foreign key(customer_id) references customers(customer_id)
ON DELETE SET NULL;

------MAKE THE NULL IN FOREIGN KEY-----

DELETE FROM customers
WHERE customer_id = 1;
SELECT * from transactions;

#### **CASCADE DELETE**

```SQL
-------INSERT AGAIN VALUES-------
INSERT INTO customers
VALUES(1, "JANE", "RUBY", NULL, "JANE@GMAIL.COM" );
SELECT * FROM customers

------DELTE FK------

ALTER table transactions
DROP foreign key fk_customer_id


--------ON DELETE CASCADE---

ALTER table transactions
ADD constraint fk_customer_id
foreign key(customer_id) references customers(customer_id)
ON DELETE CASCADE;

---transactions inerst-------

SET FOREIGN_KEY_CHECKS = 0;
UPDATE transactions
set customer_id = 4
where transaction_id = 1003;

SELECT * FROM transactions

-------delete--------

delete from customers
where customer_id = 2;

SELECT * FROM customers

-----------

# **08. STORED PROCEDURE**

    IT IS THE PREPARED SQL CODE THAT WE CAN SAVE IF ANY QUERY THAT YOU WRITE OFTEN

    REDUCES NETWORK TRAFFIC

    INCRAESES PERFORMANCE

    SECURE , ADMIN CAN GRANT PERMISSION TO USE

    INCREASE MEMORY USAGE OF EVERY CONNECTION

```SQL

SELECT first_name, last_name
from transactions
inner join customers
on transactions.customer_id = customers.customer_id


----------CREATE PROCEDURE---------

DELIMITER $$
CREATE PROCEDURE get_customers()
BEGIN
SELECT * FROM customers;
END $$
DELIMITER ;

---CALL STORED PROCEDURE-------
CALL get_customers();


-------DROP THE PROCEDURE---------
DROP PROCEDURE get_customers()

**ANOTHER EXAMPLE**

```SQL
DELIMITER $$

CREATE PROCEDURE find_customer(IN id INT)
BEGIN
	SELECT * FROM customers 
    WHERE customer_id = id;
END $$
DELIMITER ;

---CALL---------
NOTE : "giver the customer id 3 data"
CALL find_customer(3);

-----DELTELE-----

DROP PROCEDURE find_customer;

**ANOTHER EXMPLE**

```SQL

DELIMITER $$
CREATE PROCEDURE  FIND_CUSTOMER(IN f_name varchar(20), l_name varchar(20))
BEGIN
	SELECT * FROM customers
    WHERE first_name = f_name AND last_name = l_name;
END $$

DELIMITER ;


-----CALL---------

call FIND_CUSTOMER("BRO", "CARB");

----------

# **09. TRIGGERS**

1. **Automatic Execution**: Triggers automatically execute in response to specific events like `INSERT`, `UPDATE`, or `DELETE`.
2. **Before or After Events**: Triggers can run **before** or **after** a specified event on a table.
3. **Row-level or Statement-level**: Triggers can fire for each row affected or once per statement.

```SQL

--------ADD COLUMN-----------
ALTER TABLE employees
ADD COLUMN SALARY DECIMAL(10, 2) AFTER hourly_paid;
SELECT * FROM employees;


------TRIGGER THE SALARY COLUMN AUTOMATICALLY INSERT-------

SET SQL_SAFE_UPDATES = 0;

UPDATE employees
SET SALARY = hourly_paid * 2080;
SELECT * FROM employees;


---------update--------

CREATE TRIGGER before_hourly_paid_update
BEFORE UPDATE ON employees
FOR EACH ROW
SET NEW.SALARY =( NEW.hourly_paid * 2080);

---------show---------
SHOW triggers

-------automatic change--------
UPDATE employees
SET hourly_paid = 50.00
WHERE employee_id = 1;
select * FROM employees 

----all updation----------
UPDATE employees
SET hourly_paid = hourly_paid + 2;
select * FROM employees

#### **example 1**

```sql

CREATE TRIGGER hourly_paid_insert
BEFORE INSERT ON employees
FOR EACH ROW
SET NEW.SALARY = (NEW.hourly_paid * 2080);

-------value insert------
insert into employees
values(6, "rina", "lucas", "lucas@gmail.com", 23, 10, null, "cook", "2020-09-10", 9);
select * from employees;

### **example 2**

```sql

-------CARETE NEW TABLE--------

CREATE TABLE EXPENSES(
	expense_id int primary key,
    expense_name varchar(20),
    expense_total decimal(10, 2)
);
SELECT * FROM EXPENSES;

-------INSERT------

INSERT INTO expenses
VALUES(1, "SALARY", 0), (2, "RUBBER", 0), (3, "ROCK", 0);
SELECT * FROM EXPENSES;

------update---------

UPDATE expenses
SET expense_total = (select sum(salary) from employees)
where expense_id = 1;
select * from expenses;

------DELETE TRIGGER-----

CREATE TRIGGER after_salary_delete
AFTER DELETE ON employees
FOR EACH ROW
UPDATE expenses
SET expense_total = expense_total - OLD.salary
WHERE expense_name = "SALARIES" 

------WHILE DELTEING EACH EMPLYEE_ID THE SALARY DECREASE-------

delete FROM employees
WHERE employee_id = 2;
SELECT * FROM expenses;

---------------------------------------------------✌️AFTER INSERT SALARY--------------------------------------------------------------

CREATE TRIGGER after_insert_salary
after insert on employees
for each row 
update expenses
set expense_total = expense_total + new.salary
where expense_name = "salary"

------INSERT---
INSERT INTO employees
VALUES(2,"LUCKY", "NIN", "NIN@GMAIL.COM", 45, 33.33, NULL, "TEACHER", "2023-12-01", 9);
select * FROM expenses

--------------update-----------------
CREATE TRIGGER AFTER_SALRY_UPDATE
AFTER UPDATE ON employees
FOR EACH ROW
UPDATE expenses
SET expense_total = expense_total + (NEW.salary - OLD.salary)
where expense_name = "salary";

------------------

update employees
set hourly_paid = 100
where employee_id = 1;
select * from expenses;

------------